TMaxElectronics/Pic32Uart/UART.c
/*
        UART Driver for pic32
        Copyright Sep. 2018 TMAX-Electronics.de
 */

#include <stdio.h>
#include <xc.h>
#include <string.h>
#include <stdarg.h>
#include <sys/attribs.h>
#include <sys/kmem.h>

#include "UART.h"
#include "UARTconfig.h"
#include "FreeRTOSConfig.h"
#include "FreeRTOS.h"
#include "stream_buffer.h"
#include "semphr.h"
#include "TTerm.h"
#include "DMAutils.h"
#include "System.h"
#include "printf.h"
#include "Timer.h"



//TODO: put this into the config file!----------------------------------------------

#define UART_NUM_MODULES 2

static UartDescriptor_t UART_moduleMap[UART_NUM_MODULES] = {[0 ... (UART_NUM_MODULES - 1)] = {}};

//----------------------------------------------------------------------------------


//translate macros to get the interrupt numbers for different events
#define Uart_getErrorIRQNum(X) X->descriptor->errorInterruptNumber
#define Uart_getRxIRQNum(X) X->descriptor->errorInterruptNumber + 1
#define Uart_getTxIRQNum(X) X->descriptor->errorInterruptNumber + 2

#define UART_DEFAULT_SEND_TIMEOUT pdMS_TO_TICKS(1000)

//timeout for waiting for a transmission to finish. This MUST be longer than the longest expected transmission time
#define UART_TIMEOUT_TX pdMS_TO_TICKS(1000)

//this flag signals the transmitter routine that the transfer should be non-blocking
#define UART_TXFLAG_NON_BLOCKING_TRANSFER 0x0001
//this flag signals the transmitter routine that it was called from inside the library and the txSemaphore is already taken/won't need to be taken by it.
//it also won't be returned by the dma routine unless a non-blocking transfer was requested
#define UART_TXFLAG_INTERNAL_CALL 0x0002

#define UART_REGS handle->descriptor->registerMap

#define UART_EVENTFLAG_ERROR_FRAMING  0x01
#define UART_EVENTFLAG_ERROR_PARITY   0x02
#define UART_EVENTFLAG_ERROR_OVERFLOW 0x04
#define UART_EVENTFLAG_ERROR_IRQ      0x08

#define UART_EVENTFLAG_TX_IRQ 0x10
#define UART_EVENTFLAG_RX_IRQ 0x20


#define UART_isOn(handle) (UART_REGS->UMODE.w & _U2MODE_ON_MASK)
#define UART_setOn(handle, on) (UART_REGS->UMODE.ON = on)

#define UART_isOERR(handle) (UART_REGS->USTA.w & _U2STA_OERR_MASK)
#define UART_isFERR(handle) (UART_REGS->USTA.w & _U1STA_FERR_MASK)
#define UART_isPERR(handle) (UART_REGS->USTA.w & _U1STA_PERR_MASK)

#define UART_clearOERR(handle) UART_REGS->USTACLR = _U1STA_OERR_MASK
#define UART_clearFERR(handle) UART_REGS->USTACLR = _U1STA_FERR_MASK
#define UART_clearPERR(handle) UART_REGS->USTACLR = _U1STA_PERR_MASK


#define UART_getRXRegPtr(handle) &(UART_REGS->RXREG)
#define UART_getTXRegPtr(handle) &(UART_REGS->TXREG)

#define UART_isRxDataAvailable(handle) (UART_REGS->USTA.w & _U1STA_URXDA_MASK)
#define UART_isTxBufferFull(handle) (UART_REGS->USTA.w & _U1STA_URXDA_MASK)

#define UART_readChar(handle) UART_REGS->RXREG

#define UART_isTxEnabled(handle) UART_REGS->USTA.UTXEN
#define UART_isTxDMAEnabled(handle) (handle->txDMAHandle != NULL)


typedef struct{
    UartISR_t function;
    UartHandle_t * handle;
    uint32_t enabledEventFlags;
} UartISRDescriptor_t;

static UartISRDescriptor_t isrDescriptors[UART_NUM_MODULES] = {[0 ... (UART_NUM_MODULES - 1)] = {.function = NULL, .handle = NULL}};




static uint32_t UART_populateDescriptor(uint32_t module, UartHandle_t * descriptor);

typedef struct{
    uint16_t dataLength;
    unsigned freeAfterSend;
    uint8_t * data;
} UART_SENDQUE_ELEMENT;

//initializes a UART module and returns a handle for it
//NOT: module will stay disabled until UART_setModuleOn(handle, 1); is called
UartHandle_t * UART_init(uint32_t module, uint32_t baud, volatile uint32_t* TXPinReg, uint8_t RXPinReg){
    UartHandle_t * handle = pvPortMalloc(sizeof(UartHandle_t));
    
    //prepare descriptor data
    if(!UART_populateDescriptor(module, handle)){
        vPortFree(handle);
        return 0;
    }
    
    handle->TXR = TXPinReg;
    URXPinValue = RXPinReg;
    
    //assign IO
    if(TXPinReg != NULL) UTXR = UTXPinValue;
    if(RXPinReg != NULL) URXR = URXPinValue;
    
    //initialise module    //TODO proper config functions!
    
    UMODE = 0;
    USTA = 0;
    
    UART_REGS->USTA.UTXEN = TXPinReg != -1;
    UART_REGS->USTA.URXEN = RXPinReg != -1;
    
    handle->rxEnabled = (RXPinReg != -1);
    handle->txEnabled = (TXPinReg != -1);
    
    UART_setBaud(handle, baud);
    
    handle->rxStream = xStreamBufferCreate(UART_BUFFERSIZE,0);
    handle->txStream = xStreamBufferCreate(UART_BUFFERSIZE,0);
    handle->eventStream = xStreamBufferCreate(UART_EVENTBUFFER_SIZE,0);
    
    return handle;
}

void UART_setModuleOn(UartHandle_t * handle, uint32_t on){
    //would this even change anything?
    if(on == UMODEbits.ON) return; //lol no, just return as everything is already in the correct state anyway
    
    //yes, check if we are enabling or disabling the module
    if(on){
        //first enable the module to make sure the tasks won't just quit themselves
        UMODEbits.ON = 1;
        
        //enabling, check which modes are currently enabled
        if(handle->txEnabled){
            //tx is on, check if txdma is in use
            //TODO enable TX Task & DMA
            UART_REGS->USTA.UTXEN = 1;
        }
        
        if(handle->rxEnabled){
            //rx is enabled, do we need dma?
            if(handle->rxDMAHandle != NULL){
                //yes, reset the buffer and enable the channel
                DMA_RB_flush(handle->rxDMAHandle);
                DMA_setEnabled(handle->rxDMAHandle->channelHandle, 1);
            }
            
            //is the rx task still running for some reason?
            if(handle->rxRunning == 0){
                //no, start it TODO evaluate stack size :3
                xTaskCreate(UART_rxTask, "UART rx", configMINIMAL_STACK_SIZE + 100, handle, tskIDLE_PRIORITY + 2, NULL);
            }
            
            UART_REGS->USTA.URXEN = 1;
        }
    }else{
        //module is to be shut down, do so. All tasks will automatically quit once the module enable gets cleared
        UMODEbits.ON = 0;
    }
}

void UART_updateBaudForSleep(UartHandle_t * handle, uint32_t sleep){
    if(sleep){
        UART_REGS->UMODE.BRGH = 1;
        UART_REGS->BRG = (configSECONDARY_CLOCK_HZ / (4 * handle->currentBaudrate)) - 1;
    }else{
        UART_setBaud(handle, handle->currentBaudrate);
    }
}


//TODO make this function make sense... we want the maximum time resolution possible to just a fixed threshold of 250kbaud
void UART_setBaud(UartHandle_t * handle, uint64_t newBaud){
    handle->currentBaudrate = newBaud;
    if(newBaud > 250000){
        UART_REGS->UMODE.BRGH = 1;
        UART_REGS->BRG = (configPERIPHERAL_CLOCK_HZ / (4 * newBaud)) - 1;
    }else{
        UART_REGS->UMODE.BRGH = 0;
        UART_REGS->BRG = (configPERIPHERAL_CLOCK_HZ / (16 * newBaud)) - 1;
    }
}

uint32_t UART_getBaud(UartHandle_t * handle){
    return (configPERIPHERAL_CLOCK_HZ/ (((UART_REGS->UMODE.BRGH) ? 4 : 16) * (UART_REGS->BRG+1)));
}


//sends a string directly to the output buffer, incase there is some dramatic error
//we don't use the semaphore here as this will only be called from a context where an error prevents the semaphore from being released (tx error, _general_exception_handler, vAssert, etc.)
void UART_sendString(UartHandle_t * handle, char *data){
    while((*data) != 0){
        while(UART_isTxBufferFull(handle));
        UART_REGS->TXREG = *data++;
    }
}









