TMaxElectronics/Pic32Uart/UART.c
#define UART_RW_LEAVE_UNCHANGED 0xffffffff


//enable or disable the internal rx and tx routines
//WARNING: when disabling the rx dma the user must ensure that no task is currently trying to read from the dma buffer as it will be freed!
uint32_t UART_setInternalRWEnabled(UartHandle_t * handle, uint32_t rxEnabled, uint32_t txEnabled){
    
    //should we change something about the rx routines?
    if(rxEnabled != UART_RW_LEAVE_UNCHANGED){
        //are we switching the rx routines on?
        if(rxEnabled){
            //yes, check if it is already on. if so we can return as there's nothing to do
            if(handle->rxDMAHandle != NULL) return pdPASS;

            //rx is not enabled but user wants it to be. Allocate a new dma ringbuffer
            DMA_RingBufferHandle_t * newBuffer = DMA_createRingBuffer(UART_BUFFERSIZE, 1, UART_getRXRegPtr(handle), Uart_getRxIRQNum(handle), 1, RINGBUFFER_DIRECTION_RX);

            //we used to set the abort irq to the fault interrupt, but don't do this anymore as in case of a fault occuring all data is flushed from the buffer and lost
            //a uart error would cause our own interrupt handler to be invoked, where we could deal with the issue ourselves
            //DMA_RB_setAbortIRQ(handle->rxDMAHandle, handle->fltVector, 1);

            //enable the dma channel
            DMA_setEnabled(newBuffer->channelHandle, 1);
            
            //set up the rx interrupt to occur as long as there is data in the buffer
            UART_setRxIrqMode(handle, UART_RX_IRQ_WHEN_DATA_AVAILABLE);
            
            //assign the buffer
            handle->rxDMAHandle = newBuffer;
        }else{
            //no, free the currently present ringbuffer

            if(handle->rxDMAHandle == NULL) return pdPASS; //already free'd

            //free the buffer
            DMA_freeRingBuffer(handle->rxDMAHandle);
            handle->rxDMAHandle = NULL;
        }
    }
    
    //should we change something about the tx routines?
    if(txEnabled != UART_RW_LEAVE_UNCHANGED){
        //are we switching the rx routines on?
        if(txEnabled){
            //yes, check if it is already on. if so we can return as there's nothing to do
            if(handle->txDMAHandle != NULL) return pdPASS;
            
            //tx is currently off and needs to be enabled. Allocate a dma channel
            DmaHandle_t * newChannel = DMA_allocateChannel();
            
            //set constant transfer attributes (src will be set once a transfer is initiated)
            DMA_setDestConfig(newChannel, UART_getTXRegPtr(handle), 1);
            DMA_setChannelAttributes(newChannel, 0, 0, 0, 0, 2);
            
            //set up interrupts
            DMA_setIRQHandler(newChannel, UART_txDmaISR, handle);
            DMA_setInterruptConfig(newChannel, 0, 0, 0, 0, 1, 0, 1, 1); //block complete, abort and error irqs enabled
            
            //and finally set up the tx interrupt to occur as long as there is space in the tx buffer
            UART_setTxIrqMode(handle, UART_TX_IRQ_WHEN_SPACE);
            
            //finally assign the channel
            handle->txDMAHandle = newChannel;
        }else{
            //no, free the currently present ringbuffer

            if(handle->txDMAHandle == NULL) return pdPASS; //already free'd
            
            //make sure no transmission is currently going on
            if(!xSemaphoreTake(handle->txSemaphore, portMAX_DELAY)){
                //what somehow this didn't work... we need to return
                return pdFAIL;
            }
            
            //no transmission going on, its safe to free the dma
            DMA_freeChannel(handle->txDMAHandle);
            handle->txDMAHandle = NULL;
            
            //return the semaphore
            xSemaphoreGive(handle->txSemaphore);
        }
    }
}
 
static void UART_handleInterrupt(uint32_t moduleNumber, uint32_t ifsState){
    //a uart irq just occurred, check what we need to do to handle it
    
    //is there a handle defined for the module?
    if(isrDescriptors[moduleNumber].handle == NULL){
        //no, switch off the timer and return
        UART_setIRQsEnabledInternal(moduleNumber, 0);
        
        return;
    }
    
    //first get the handle
    UartHandle_t * handle = isrDescriptors[moduleNumber-1].handle;
    
    //check what interrupt occured 
    
    uint32_t evtFlags = 0;
    
    if(ifsState & handle->descriptor->errorMask){
        //error interrupt. get the error type(s) and push a notification into the handle's event queue
        
        evtFlags |= UART_EVENTFLAG_ERROR_IRQ;
        
        //figure out what errors occurred and deal with them
        
        if(UART_REGS->USTA->FERR){ //framing error, no need to reset this
            evtFlags |= UART_EVENTFLAG_ERROR_FRAMING;
        }
        
        if(UART_REGS->USTA->PERR){ //parity error, also no need to reset this 
            evtFlags |= UART_EVENTFLAG_ERROR_PARITY;
        }
        
        if(UART_REGS->USTA->OERR){ //overflow error, this will need to be reset loosing the data currently in the buffer
            evtFlags |= UART_EVENTFLAG_ERROR_OVERFLOW;
            
            //clear the error
            UART_clearOERR(handle);
        }
        
        //then we send any events to the eventStream. We do this now as rx and tx events don't need to go there TODO: evaluate if we might not need them after all
        xStreamBufferSendFromISR(handle->eventStream, &evtFlags, 1, NULL);
    }
    
    if(ifsState & handle->descriptor->txMask){
        //tx interrupt
        evtFlags |= UART_EVENTFLAG_TX_IRQ;
    }
    
    if(ifsState & handle->descriptor->rxMask){
        //rx interrupt
        evtFlags |= UART_EVENTFLAG_RX_IRQ;
    }
    
    //now check if an isr is assigned to this module and we have an event for it
    if(isrDescriptors[moduleNumber-1].function != NULL && (evtFlags & isrDescriptors[moduleNumber-1].enabledEventFlags) > 0){
        //yep we have an isr and and event to dispatch to it
        (*isrDescriptors[moduleNumber-1].function)(handle, evtFlags);
    }
}

//interrupt related functions


//assign an interrupt routine to a module. To de-assign call with isr* = NULL
uint32_t UART_setISR(UartHandle_t * handle, UartISR_t isr){
    //are we assigning or de-assigning?
    if(isr == NULL){
        //write NULL into the isr list for the function and we're done
        isrDescriptors[handle->number-1].function = NULL;
    }else{
        //is there already a function assigned? If so we won't overwrite it
        if(isrDescriptors[handle->number-1] != NULL) return pdFAIL;
        
