TMaxElectronics/Pic32Uart/UART.c
        //assign the functions
        isrDescriptors[handle->number-1].function = isr;
    }
    
    return pdPASS;
}

void UART_setInterruptPriority(TimerHandle_t * handle, uint32_t priority, uint32_t subPriority){
    //we will have to perform a read-modify-write on the register to update the priority
    //since this would take forever though we utilise the pics SET and CLR registers together with a mask
    
    //first we need to select the correct descriptor. If the timer is in 32bit mode all interrupt related settings come from the slave timer
    UartDescriptor_t * desc = handle->descriptor;
    
    //first we make sure the interrupt is off
    uint32_t irqsEnabled = UART_getIRQsEnabledInternal(handle->number);
    UART_setIRQsEnabledInternal(handle, 0);
    
    //then we clear the priority bits. There are 5 (hence 0b11111) and located at the offset pointed to by ipcOffset
    desc->ipcReg->CLR = 0b11111 << desc->ipcOffset;
    
    //then we generate the new priority bits
    Pic32PrioBits_t map = {.priority = priority, .subPriority = subPriority};
    
    //after that we assign the shifted mask to the SET register to complete the operation
    desc->ipcReg->SET = map.map << desc->ipcOffset;
   
    UART_setIRQsEnabledInternal(handle, irqsEnabled);
}

//external function, this only returns what events will cause the set isr to be called
uint32_t UART_getIRQsEnabled(UartHandle_t * handle){
    return isrDescriptors[handle->number-1].enabledEventFlags;
}

//function to get what iec bits are set
static uint32_t UART_getIRQsEnabledInternal(uint32_t moduleNumber){
    uint32_t ret = 0;
    
    if(UART_moduleMap[moduleNumber - 1].iecReg->w & UART_moduleMap[moduleNumber - 1].rxMask) ret |= UART_EVENTFLAG_RX_IRQ;
    if(UART_moduleMap[moduleNumber - 1].iecReg->w & UART_moduleMap[moduleNumber - 1].txMask) ret |= UART_EVENTFLAG_TX_IRQ;
    if(UART_moduleMap[moduleNumber - 1].iecReg->w & UART_moduleMap[moduleNumber - 1].errorMask) ret |= UART_EVENTFLAG_ERROR_IRQ;
    
    return ret;
}

//sets which interrupts are enabled. The error interrupt is always on and will always call the libraries internal isr
void UART_setIRQsEnabled(UartHandle_t * handle, uint32_t eventIrqsEnabled){
    //call the internal function, but make sure to not disable the error interrupt
    UART_setIRQsEnabledInternal(handle->number, eventIrqsEnabled | UART_EVENTFLAG_ERROR_IRQ);
    
    //then update the enabled events in the isr descriptor
    isrDescriptors[handle->number-1].enabledEventFlags = eventIrqsEnabled;
}

//internal function that can also set error irq
static void UART_setIRQsEnabledInternal(uint32_t moduleNumber, uint32_t eventIrqsEnabled){
    //write the required bits into the iec register
    if(eventIrqsEnabled & UART_EVENTFLAG_RX_IRQ) UART_moduleMap[moduleNumber - 1].iecReg->SET = UART_moduleMap[moduleNumber - 1].rxMask; else UART_moduleMap[moduleNumber - 1].iecReg->CLR = UART_moduleMap[moduleNumber - 1].rxMask;
    if(eventIrqsEnabled & UART_EVENTFLAG_TX_IRQ) UART_moduleMap[moduleNumber - 1].iecReg->SET = UART_moduleMap[moduleNumber - 1].txMask; else UART_moduleMap[moduleNumber - 1].iecReg->CLR = UART_moduleMap[moduleNumber - 1].txMask;
    if(eventIrqsEnabled & UART_EVENTFLAG_ERROR_IRQ) UART_moduleMap[moduleNumber - 1].iecReg->SET = UART_moduleMap[moduleNumber - 1].errorMask; else UART_moduleMap[moduleNumber - 1].iecReg->CLR = UART_moduleMap[moduleNumber - 1].errorMask;
}

void UART_setTxIrqMode(UartHandle_t * handle, uint32_t interruptMode){
    
}

void UART_setRxIrqMode(UartHandle_t * handle, uint32_t interruptMode){
    
}

void UART_setFlowControl(UartHandle_t * handle, uint32_t pinMode, uint32_t flowControlMode){
    
}
            
void UART_setOutputInvert(UartHandle_t * handle, uint32_t invertRx, uint32_t invertTx){
    
}
            
void UART_setParity(UartHandle_t * handle, uint32_t invertRx, uint32_t invertTx){
    
}
            
void UART_setStopBits(UartHandle_t * handle, uint32_t invertRx, uint32_t invertTx){
    
}

//function that handles the DMA interrupt when transmitting data
static uint32_t UART_txDmaISR(uint32_t evt, void * data){
    
    //freeRtos magic :3
    BaseType_t wake1 = pdFALSE;
    BaseType_t wake2 = pdFALSE;

    //tx DMA interrupt just occured
    
    //first get our handle
    UartHandle_t * handle = (UartHandle_t *) data;
    
    //we don't need to check which event occured, as all would be treated almost identically anyway

    //return the dma semaphore
    xSemaphoreGiveFromISR(handle->txDmaSemaphore, &wake1);

    //clean up dma
    DMA_setIRQEnabled(handle->txDMAHandle, 0);
    if(evt & DMA_EVTFLAG_ADDRERR) DMA_abortTransfer(handle->txDMAHandle); //if some address error was detected we want to abort the transfer. Any other event thats enabled already does this by itself

    //then check if we also need to return the normal txSemaphore
    if(handle->txISRFlags & UART_TXFLAG_NON_BLOCKING_TRANSFER){
        //last transmission was a non-blocking one so we need to do the cleanup

        //clear the txEn pin if needed
        //TODO: clear txEn

        //and finally return the txSemaphore
        xSemaphoreGiveFromISR(handle->txSemaphore, &wake2);
    }
    
    //TODO: the way this is implemented right now the user won't be able to know if something went wrong with the transmission after dma was started unless a timeout occurs instead of a dma error (which is pretty unlikely)
    
    portEND_SWITCHING_ISR(wake1 || wake2);
}

//this function sends bytes from a buffer out on the uart line
//IMPORTANT: if you use this function in non-blocking mode you must make sure that the buffer does not get accessed or (even worse) freed immediately after this function returns as it is still busy sending bytes
uint32_t UART_sendBuffer(UartHandle_t * handle, char * buffer, uint32_t size, uint32_t waitTimeout, uint32_t txFlags){
    //is there anything to send and tx even enabled? If not we can just return as we can't do anything anyway
    if(!(UART_isTxEnabled(handle) && UART_isTxDMAEnabled(handle))) return 0;
    
    //next we need to get the TX semaphore if the transfer was triggered from outside the library. If this times out we also just return without transmitting anything
    //We will also only return it in the following code if the function call was made from outside of the library
    if(!(txFlags & UART_TXFLAG_INTERNAL_CALL) &&  !xSemaphoreTake(handle->txSemaphore, waitTimeout)) return 0; //TODO evaluate if the second condition is actually not run!
    
    //WARNING TO ME: from this point on any return from this function must ensure that the txSemaphore gets returned!
    
    
    
    //we also have to take the txDmaSemaphore, which is used to signal completion of a transmission
    if(!xSemaphoreTake(handle->txDmaSemaphore, waitTimeout)){ 
        //This is a state that should never be reached! The only time that the txSemaphore is returned is when a transmission has completed, at which point the txDmaSemaphore MUST also be returned
        configASSERT(0);
        
